<?php
// Forum  : WwW.OpenCartFarsi.com
// Website: WwW.OpenCartFarsi.ir
// E-Mail : info@OpenCartFarsi.ir

// Heading
$_['heading_title']     = 'آپگرید';
$_['heading_success'] 	= 'آپگرید - کامل شد!';

// Text
$_['text_upgrade']    	= 'در حال آماده سازی برای آپگرید';
$_['text_server']     	= 'تنظیمات سرورتان را چک کنید که به درستی پیکربندی شده باشد';
$_['text_steps']      	= 'پیشرفت آپگرید';
$_['text_error']      	= 'هرگونه ارور و مشکل آپگرید اسکریپت را در انجمن پشتیبانی اپن کارت فارسی دات کام گزارش نمایید';
$_['text_clear']      	= 'بعد از آپگرید، کوکی های مرورگر خود را  برای جلوگیری از دریافت ارور پاک سازی نمایید.';
$_['text_admin']      	= 'صفحه مدیریت را لود کرده و Ctrl+F5 را دو بار فشار داده تا مرورگر تغییرات css را به روز رسانی نمایید.';
$_['text_user']       	= 'به قسمت سیستم -> کاربران -> گروه های کاربری (Admin -> System -> Users -> User Groups) رفته و مدیریت ارشد (Top Adminstrator) را ویرایش نموده و همه ی گزینه ها را انتخاب نمایید.';
$_['text_setting']    	= 'به پنل مدیریت رفته و تنظیمات اصلی سیستم را ویرایش نمایید. همه ی فیلد ها را به روز رسانی کرده و بر روی ذخیره کلیک نمایید، حتی اگر هیچ چیز تغییر نکرده باشد.';
$_['text_store']      	= 'ویترین فروشگاه را لود کرده و Ctrl+F5 را دو بار فشار داده تا مرورگر تغییرات css را به روز رسانی نمایید.';
$_['text_end_1']   	  	= 'فراموش نکنید قبل از هر کاری یکبار از بانک اطلاعاتی خود جهت اطمینان خاطر پشتیبان بگیرید و سپس اقدام به آپگرید کنید.';
$_['text_end_2']   	  	= 'اپن کارت فارسی دات کام هیچگونه مسئولیتی در صورتی که موارد فوق را رعایت نکنید، بر عهده نخواهد گرفت.';
$_['text_progress']   	= 'Patch %s اعمال شد (%s از %s)';
$_['text_success']    	= 'تبریک می گوییم! شما فروشگاه اپن کارت فارسی شده توسط <a href="https://www.opencartfarsi.ir/" target="_blank">اپن کارت فارسی</a> را با موفقیت آپگرید نمودید!';

// Entry
$_['entry_progress']  = 'پیشرفت';

// Error
$_['error_admin']       = 'خطا: فایل کانفیگ %s پیدا نشد. مطمئن شوید که نام پوشه admin درست باشد!';
$_['error_file']        = 'خطا: فایل کانفیگ %s پیدا نشد!';
$_['error_writable']    = 'خطا: فایل کانفیگ %s غیر قابل نوشتن است!';
$_['error_upgrade']     = 'خطا: هیچ فایل آپگریدی یافت نشد!';
$_['error_server']      = 'خطا: مقدار HTTP_SERVER را نمی توان پیدا کرد!';
$_['error_db_driver']   = 'خطا: مقدار DB_DRIVER را نمی توان پیدا کرد!';
$_['error_db_hostname'] = 'خطا: مقدار DB_HOSTNAME را نمی توان پیدا کرد!';
$_['error_db_username'] = 'خطا: مقدار DB_USERNAME را نمی توان پیدا کرد!';
$_['error_db_password'] = 'خطا: مقدار DB_PASSWORD را نمی توان پیدا کرد!';
$_['error_db_database'] = 'خطا: مقدار DB_DATABASE را نمی توان پیدا کرد!';
$_['error_db_port']     = 'خطا: مقدار DB_PORT را نمی توان پیدا کرد!';
$_['error_db_prefix']   = 'خطا: مقدار DB_PREFIX را نمی توان پیدا کرد!';
?>